# Задачи Множества
# Задача №1.

# Даны два списка чисел. Выведите все числа, 
# которые входят как в первый, так и во второй список в порядке возрастания.
# a_set = set([1, 2, 35,56, 56, 8966656996, 596])
# b_set = {2, 35,55, 596, 555, 56, 31,555}

# Задача №2.

#   Удалите случайный элемент из множества:

# names_a = {"Nicholas", "Michelle", "John", "Mercy"}
# print(names_a.pop())
# print(names_a)

# Задача №3.
  
# Удалите из множества "Nicholas" и "Mercy":

# names_a = {"Nicholas", "Mercy", "Michelle", "John", "Nicholas",
# "Mercy", "Jeff", "Bosco", "Nicholas",  "Teddy", "Milly"}

# names_a.discard("Nicholas"), names_a.discard("Mercy")
# print(names_a)

# Задача №4.

# Узнать длину множества:

names_a = {"Nicholas", "Mercy", "Michelle", "John", "Jeff", "Bosco", "Teddy", "Milly"}
print(len(names_a))
